app/controllers/books_controller.rb

  def index
    @books = Book.order(:id)
---
SELECT `books`.* FROM `books` ORDER BY `books`.`id` ASC

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO `books` (`title`, `author`, `price`, `published`, `created_at`, `updated_at`) VALUES ('The Great Gatsby', NULL, NULL, NULL, '2024-01-29 23:12:49.299559', '2024-01-29 23:12:49.299559')

  def edit
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1
UPDATE `books` SET `books`.`title` = 'The Grea', `books`.`updated_at` = '2024-01-28 22:21:02.238116' WHERE `books`.`id` = 8

  def delete
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 9

  def show
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1